# Parameter Type Id Rbs Elec Circuit Wire Num Others Param Property

Source: https://www.revitapidocs.com/2026/238d5354-2107-458f-07a0-9f65af345c19.htm

---

| Parameter Type Id Rbs Elec Circuit Wire Num Others Param Property |
| --- |

"\# of Other Conductors"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId RbsElecCircuitWireNumOthersParam { get; }
```

```
Public Shared ReadOnly Property RbsElecCircuitWireNumOthersParam As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ RbsElecCircuitWireNumOthersParam {
	ForgeTypeId^ get ();
}
```

```
static member RbsElecCircuitWireNumOthersParam : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace